pascal-3.2/tutorialsOld/surfaceTracking/interTrackMHDFoam/tank3D_FL/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         interTrackMHDFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             10;

deltaT              0.001;

writeControl        runTime;

writeInterval       0.01;

cycleWrite          0;

writeFormat         ascii;

writeCompression    compressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

// ************************************************************************* //

